testCases/heatTransfer/reacting/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

cp -r 0.org 0 > /dev/null 2>&1
blockMesh
decomposePar
mpirun -n 4 $application -parallel

# ----------------------------------------------------------------- end-of-file
