testCases/heatTransfer/reacting/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.06 -0.06 -0.001)
    (-0.007071 -0.007071 -0.001)
    (0.007071 -0.007071 -0.001)
    (0.06 -0.06 -0.001)
    (0.06 0.06 -0.001)
    (0.007071 0.007071 -0.001)
    (-0.007071 0.007071 -0.001)
    (-0.06 0.06 -0.001)
    (-0.06 -0.06 0.001)
    (-0.007071 -0.007071 0.001)
    (0.007071 -0.007071 0.001)
    (0.06 -0.06 0.001)
    (0.06 0.06 0.001)
    (0.007071 0.007071 0.001)
    (-0.007071 0.007071 0.001)
    (-0.06 0.06 0.001)
    (-0.06 0.14 -0.001)
    (0.06 0.14 -0.001)
    (-0.06 0.14 0.001)
    (0.06 0.14 0.001)
);


blocks
(
    hex (7 0 1 6 15 8 9 14) (45 50 1) simpleGrading (1 0.05 1)
    hex (0 3 2 1 8 11 10 9) (45 50 1) simpleGrading (1 0.05 1)
    hex (3 4 5 2 11 12 13 10) (45 50 1) simpleGrading (1 0.05 1)
    hex (4 7 6 5 12 15 14 13) (45 50 1) simpleGrading (1 0.05 1)
    hex (17 16 7 4 19 18 15 12) (45 25 1) simpleGrading (1 1 1)
);

edges
(
    arc 1 2   (0.0 -0.01 -0.001)
    arc 9 10  (0.0 -0.01 0.001)
    arc 2 5   (0.01 0.0 -0.001)
    arc 10 13 (0.01 0.0 0.001)
    arc 5 6   (0.0 0.01 -0.001)
    arc 13 14 (0.0 0.01 0.001)
    arc 6 1   (-0.01 0.0 -0.001)
    arc 14 9  (-0.01 0.0 0.001)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 11 8)

        );
    }
    outlet
    {
        type patch;
        faces
        (
            (17 16 18 19)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (0 8 15 7)
            (3 4 12 11)
            (7 15 18 16)
            (4 17 19 12)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (1 2 10 9)
            (2 5 13 10)
            (5 6 14 13)
            (6 1 9 14)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
