testCases/heatTransfer/reacting/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          45;
        startFace       20045;
    }
    outlet
    {
        type            patch;
        nFaces          45;
        startFace       20090;
    }
    sides
    {
        type            patch;
        nFaces          140;
        startFace       20135;
    }
    cylinder
    {
        type            wall;
        nFaces          180;
        startFace       20275;
    }
    defaultFaces
    {
        type            empty;
        nFaces          20250;
        startFace       20455;
    }
)

// ************************************************************************* //
