testCases/heatTransfer/reacting/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Set output format : choice of
//      xmgr
//      jplot
//      gnuplot
//      raw
//      vtk
//      csv
setFormat csv;

interpolationScheme cellPointFace;

fields
(
    p
    T
    U
);

sets
(
    lineX1
    {
        type        midPointAndFace;
        axis        distance;

        start       (-0.00 0.0 0.0);
        end         (-0.00 2.0 0.0);
    }
);

// *********************************************************************** //
